In [172]:
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
%matplotlib inline

In [173]:
sb.get_dataset_names

In [174]:
sb.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [175]:
data=sb.load_dataset('tips')

In [176]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [177]:
data.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [178]:
data['extra']=1

In [179]:
data.head()

   total_bill   tip     sex smoker  day    time  size  extra
0       16.99  1.01  Female     No  Sun  Dinner     2      1
1       10.34  1.66    Male     No  Sun  Dinner     3      1
2       21.01  3.50    Male     No  Sun  Dinner     3      1
3       23.68  3.31    Male     No  Sun  Dinner     2      1
4       24.59  3.61  Female     No  Sun  Dinner     4      1

In [180]:
def swap(data,c1,c2):
    data['temp']=data[c1]
    data[c1]=data[c2]
    data[c2]=data['temp']
    data.drop(columns=['temp'],inplace=True)

In [181]:
swap(data,'total_bill','extra')

In [182]:
data.head()

   total_bill   tip     sex smoker  day    time  size  extra
0           1  1.01  Female     No  Sun  Dinner     2  16.99
1           1  1.66    Male     No  Sun  Dinner     3  10.34
2           1  3.50    Male     No  Sun  Dinner     3  21.01
3           1  3.31    Male     No  Sun  Dinner     2  23.68
4           1  3.61  Female     No  Sun  Dinner     4  24.59

In [183]:
data['target']=data['extra']
data

     total_bill   tip     sex smoker   day    time  size  extra  target
0             1  1.01  Female     No   Sun  Dinner     2  16.99   16.99
1             1  1.66    Male     No   Sun  Dinner     3  10.34   10.34
2             1  3.50    Male     No   Sun  Dinner     3  21.01   21.01
3             1  3.31    Male     No   Sun  Dinner     2  23.68   23.68
4             1  3.61  Female     No   Sun  Dinner     4  24.59   24.59
..          ...   ...     ...    ...   ...     ...   ...    ...     ...
239           1  5.92    Male     No   Sat  Dinner     3  29.03   29.03
240           1  2.00  Female    Yes   Sat  Dinner     2  27.18   27.18
241           1  2.00    Male    Yes   Sat  Dinner     2  22.67   22.67
242           1  1.75    Male     No   Sat  Dinner     2  17.82   17.82
243           1  3.00  Female     No  Thur  Dinner     2  18.78   18.78

[244 rows x 9 columns]

In [184]:
data.head()
data=data.drop(columns='extra')

In [185]:
data.head()

   total_bill   tip     sex smoker  day    time  size  target
0           1  1.01  Female     No  Sun  Dinner     2   16.99
1           1  1.66    Male     No  Sun  Dinner     3   10.34
2           1  3.50    Male     No  Sun  Dinner     3   21.01
3           1  3.31    Male     No  Sun  Dinner     2   23.68
4           1  3.61  Female     No  Sun  Dinner     4   24.59

In [186]:
sex={
    'Female':1,
    'Male':2
}
data['sex']=data['sex'].map(sex)

In [187]:
data.head()

   total_bill   tip sex smoker  day    time  size  target
0           1  1.01   1     No  Sun  Dinner     2   16.99
1           1  1.66   2     No  Sun  Dinner     3   10.34
2           1  3.50   2     No  Sun  Dinner     3   21.01
3           1  3.31   2     No  Sun  Dinner     2   23.68
4           1  3.61   1     No  Sun  Dinner     4   24.59

In [188]:
data=pd.get_dummies(data,columns=['smoker'],drop_first=True)

In [189]:
data.head(10)

   total_bill   tip sex  day    time  size  target  smoker_No
0           1  1.01   1  Sun  Dinner     2   16.99          1
1           1  1.66   2  Sun  Dinner     3   10.34          1
2           1  3.50   2  Sun  Dinner     3   21.01          1
3           1  3.31   2  Sun  Dinner     2   23.68          1
4           1  3.61   1  Sun  Dinner     4   24.59          1
5           1  4.71   2  Sun  Dinner     4   25.29          1
6           1  2.00   2  Sun  Dinner     2    8.77          1
7           1  3.12   2  Sun  Dinner     4   26.88          1
8           1  1.96   2  Sun  Dinner     2   15.04          1
9           1  3.23   2  Sun  Dinner     2   14.78          1

In [190]:
data=pd.get_dummies(data,columns=['day','time'],drop_first=True)

In [191]:
data.head()

,total_bill,tip,sex,size,target,smoker_No,day_Fri,day_Sat,day_Sun,time_Dinner
0,1,1.01,1,2,16.99,1,0,0,1,1
1,1,1.66,2,3,10.34,1,0,0,1,1
2,1,3.50,2,3,21.01,1,0,0,1,1
3,1,3.31,2,2,23.68,1,0,0,1,1
4,1,3.61,1,4,24.59,1,0,0,1,1

In [192]:
y=data['target']

In [193]:
X=data.drop(columns=['target'])
X.shape

(244, 9)

In [194]:
x=X.T
x.shape

(9, 244)

In [195]:
A=x.dot(X)

In [196]:
B=x.dot(y)

In [197]:
Q=A.dot(B)

In [198]:
Q

total_bill     2.640581e+07
tip            8.919031e+07
sex            4.427432e+07
size           7.361593e+07
smoker_No      1.668232e+07
day_Fri        1.790574e+06
day_Sat        9.486359e+06
day_Sun        9.044143e+06
time_Dinner    1.983140e+07
dtype: float64

In [199]:
T

0      3.535521e+08
1      5.294160e+08
2      6.935262e+08
3      6.029641e+08
4      7.326787e+08
           ...
239    9.098089e+08
240    4.256104e+08
241    4.698847e+08
242    4.642694e+08
243    5.219966e+08
Length: 244, dtype: float64

In [240]:
ss_t==0
ss_r==0

T=np.matmul(X,Q)
mean_y=np.mean(y)
for i in range(len(X)):
    ss_t += (y[i]-mean_y)**2
    ss_r += (y[i]-T)**2

ss_t.sum()

346652.35349754046

In [236]:
T

0      3.535521e+08
1      5.294160e+08
2      6.935262e+08
3      6.029641e+08
4      7.326787e+08
           ...
239    9.098089e+08
240    4.256104e+08
241    4.698847e+08
242    4.642694e+08
243    5.219966e+08
Length: 244, dtype: float64

In [220]:
from sklearn.linear_model import LinearRegression

In [221]:
lin=LinearRegression()

In [222]:
lin=lin.fit(X,y)

In [239]:
y_pre=lin.predict(X)
y_pre
for i in range(len(X)):
    ss_t += (y[i]-mean_y)**2
    ss_r += (y[i]-y_pre)**2
    
ss_t

327393.88941434363

In [225]:
from sklearn.metrics import accuracy_score

In [241]:
1-(y_pre.sum()/ss_t)

0.9860731653736363

In [541]:
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
%matplotlib inline

In [542]:
data=sb.load_dataset('tips')

In [543]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [544]:
from sklearn.linear_model import LinearRegression

In [545]:
lin=LinearRegression()

In [546]:
from sklearn.metrics import accuracy_score

In [547]:
from sklearn.preprocessing import StandardScaler

In [548]:
sc=StandardScaler()
y_sc=StandardScaler()

In [566]:
X=data.iloc[:,1:7]
Y=data.iloc[:,0]

In [567]:
sex={
    'Male':0,
    'Female':1
}

X['sex']=X['sex'].map(sex)

In [568]:
smoker={
    'No':0,
    'Yes':1
}
X['smoker']=X['smoker'].map(smoker)

In [569]:
X['day'].unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Sun', 'Sat', 'Thur', 'Fri']

In [570]:
day={
    'Sun':0,
    'Sat':1,
    'Fri':2,
    'Thur':3
}
X['day']=X['day'].map(day)

In [571]:
X['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Dinner', 'Lunch']

In [572]:
time={
    'Dinner':0,
    'Lunch':1
}
X['time']=X['time'].map(time)

In [573]:
X

      tip sex smoker day time  size
0    1.01   1      0   0    0     2
1    1.66   0      0   0    0     3
2    3.50   0      0   0    0     3
3    3.31   0      0   0    0     2
4    3.61   1      0   0    0     4
..    ...  ..    ...  ..  ...   ...
239  5.92   0      0   1    0     3
240  2.00   1      1   1    0     2
241  2.00   0      1   1    0     2
242  1.75   0      0   1    0     2
243  3.00   1      0   3    0     2

[244 rows x 6 columns]

In [574]:
X_test=sc.fit_transform(X)

In [575]:
Y = Y.values.reshape(-1,1)

In [576]:
Y_tt=y_sc.fit_transform(Y)

In [577]:
lin=lin.fit(X_test,Y_tt)

In [578]:
y_pred=lin.predict(X_test)

In [583]:
Y_tt.shape

(244, 1)

In [586]:
lin.score(X_test,Y_tt)

0.5790309589500482